{
    "shortcuts": [
        {
            "keyword": "d@",
            "type": "text",
            "content": "# Vai trò & bối cảnh\nBạn là một kỹ sư phần mềm Python dày dạn kinh nghiệm, chuyên viết ứng dụng desktop cho Windows.  \nTôi muốn bạn thiết kế & lập trình **một phần mềm Auto Text & Image** (tương tự ảnh minh hoạ tôi đính kèm) theo các yêu cầu chi tiết bên dưới.\n\n# Mục tiêu tổng quát\nTạo một ứng dụng desktop nhẹ, chạy ngầm, cho phép người dùng định nghĩa “cụm từ tắt” (shortcut) và tự động chuyển chúng thành:\n1. **Văn bản đơn giản**  \n2. **Văn bản có định dạng** (giữ format rich-text khi dán vào Word, Gmail, v.v.)  \n3. **Ảnh** (copy ảnh vào clipboard để có thể ⌃V/⌘V dán thẳng)  \n\n# Yêu cầu chi tiết tính năng\n1. **Gõ tắt real-time**  \n   - Khi chương trình hoạt động, nếu người dùng gõ “vdm” + Space/Enter thì tự động xoá “vdm” và chèn “vuducmanh”.  \n   - Phải lắng nghe bàn phím ở mọi cửa sổ (global hook).  \n   - Cho phép thêm/sửa/xoá shortcut ngay trong UI, thay đổi có hiệu lực tức thì.\n\n2. **Quản lý cấu hình**  \n   - Lưu cấu hình shortcut vào một file **JSON** (ví dụ `shortcuts.json`).  \n   - Nút **Import** (chọn file JSON) và **Export** (ghi file JSON) trong UI.\n\n3. **Chế độ chạy ngầm & khay hệ thống (System Tray)**  \n   - Đóng cửa sổ chính ➜ thu nhỏ xuống khay (vẫn hoạt động).  \n   - Click phải biểu tượng khay có menu: *Mở cửa sổ*, *Tạm dừng / Tiếp tục*, *Thoát hẳn*.\n\n4. **Tự khởi động cùng Windows**  \n   - Tùy chọn “Khởi động cùng hệ thống” trong tab *Cài đặt*.  \n   - Cài đặt/rút gọn bằng cách thêm/xoá shortcut `.lnk` trong thư mục  `%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`.\n\n5. **Giao diện**  \n   - Dùng **Tkinter** (hoặc PyQt6 tuỳ bạn chọn, nhưng ưu tiên Tkinter để giảm phụ thuộc).  \n   - Bố cục gồm:  \n     *Bảng danh sách* (DataGrid) shortcut bên trái, *Form thêm/sửa* bên phải, tab *Cài đặt*.  \n   - Hiển thị tổng số shortcut & trạng thái “Đang theo dõi bàn phím” giống ảnh minh hoạ.\n\n6. **Đóng gói**  \n   - Hướng dẫn build EXE bằng **PyInstaller** (one-file, icon riêng).  \n   - Giải thích cách ký ứng dụng nếu cần tránh SmartScreen.\n\n# Gợi ý thư viện\n- `keyboard` hoặc `pynput` để hook phím.  \n- `pyperclip` + `pywin32` cho clipboard (text & image).  \n- `pystray` để tạo system-tray.  \n- `Pillow` nếu cần chuyển hình ảnh sang clipboard.  \n\n# Yêu cầu về mã nguồn\n- Viết mã Python ≥ 3.10, cấu trúc thành các file:",
            "enabled": true
        },
        {
            "keyword": "qr@",
            "type": "image",
            "content": "C:/Users/Admin/Downloads/qr.jpg",
            "enabled": true
        },
        {
            "keyword": "hi@",
            "type": "text",
            "content": "dsadasdasdas",
            "enabled": true
        },
        {
            "keyword": "mm@",
            "type": "text",
            "content": "AE Cung cấp mình 1 số thông tin trước khi giao dịch nhé.\n---------------------------\nThông tin giao dịch: \n1: Ai là người mua / ai là người bán \n2: Giá trị acc \n3: Loại mail: \n4 Mn có hold 7 ngày sau khi gd không \n---------------------------\nPhí Giao dịch: Miễn Phí cho các giao dịch từ 2M trở xuống\nTừ 2M1 trở lên giá sẽ là 10K/1M\n---------------------------\nLưu ý khi thuê midman: \nMidman sẽ chỉ đảm bảo cho quá trình giao dịnh thuận lợi giữa người mua và người bán , sau khi acc đã được thay thông tin xong và xác nhận lại là không có vấn đề gì từ phía người mua thì mình sẽ chuyển tiền cho người bán , nếu có phát sinh vấn đề gì sau gd midman sẽ không thể hỗ trợ",
            "enabled": true
        },
        {
            "keyword": "ts@",
            "type": "text",
            "content": "Cảm ơn bạn. Mình sẽ bắt đầu nghiên cứu các yếu tố vĩ mô về kinh tế, chính trị, địa chính trị và chiến tranh có thể ảnh hưởng đến giá cổ phiếu PNJ trong vòng 6 tháng tới.\n\nMình sẽ tổng hợp các thông tin cập nhật từ cả trong nước và quốc tế, phân tích xu hướng giá vàng, lãi suất, chi tiêu tiêu dùng, cũng như tình hình địa chính trị (ví dụ như xung đột ở Trung Đông, quan hệ Mỹ - Trung, v.v.) để đưa ra đánh giá về ảnh hưởng tiềm năng đến PNJ.\n\nMình sẽ sớm gửi lại bản tổng hợp và phân tích chi tiết cho bạn.\n\n\n# Báo cáo phân tích yếu tố vĩ mô tác động đến cổ phiếu PNJ\n\n## Tình hình kinh tế vĩ mô trong nước\n\n* **Lãi suất tiền tệ:** Ngân hàng Nhà nước duy trì chính sách tiền tệ linh hoạt, giữ lãi suất điều hành ở mức thấp để hỗ trợ vay vốn. Các ngân hàng thương mại đã hạ lãi suất cho vay bình quân, dao động khoảng 6,34%/năm (tính đến 10/4/2025), giảm khoảng 0,6 điểm phần trăm so với cuối năm 2024. Điều này giúp kích thích đầu tư và tiêu dùng tín dụng, hỗ trợ tăng trưởng kinh tế. Mặt bằng lãi suất tiền gửi cũng ở mức thấp, tạo điều kiện cho doanh nghiệp và người dân giảm chi phí vốn. Đồng thời, NHNN đã sử dụng nghiệp vụ thị trường mở linh hoạt và giảm phát hành tín phiếu để điều tiết thanh khoản.\n* **Tỷ giá và tiền tệ:** Tỷ giá VND/USD tiếp tục ổn định nhưng chịu áp lực từ yếu tố quốc tế. Đến 22/4/2025, tỷ giá giao dịch quanh mức \\~25.896 VND/USD, tăng khoảng 1,64% so với cuối năm 2024. Các tổ chức quốc tế dự báo đồng VND có thể yếu thêm trong năm 2025 (UOB dự báo khoảng 25.800 – 26.000 VND/USD nửa cuối năm), nguyên nhân từ tăng trưởng chậm lại của Trung Quốc và nguy cơ Mỹ áp thuế. Song NHNN cam kết duy trì ổn định tỉ giá trong biên độ cho phép, giúp hạn chế lạm phát nhập khẩu.\n* **Lạm phát:** Lạm phát cơ bản được kiểm soát tốt và thấp hơn mục tiêu. Bình quân cả năm 2024, lạm phát chung khoảng 3,63% (mục tiêu năm 2024 là 4%) và lạm phát cơ bản khoảng 2,71%. Bước sang quý I/2025, lạm phát tiếp tục ở mức thấp (trung bình 3 tháng đầu năm \\~3,22%; lạm phát cơ bản \\~3,01%) nhờ giá xăng dầu trong nước giảm theo xu hướng thế giới và nguồn cung hàng hóa cơ bản ổn định. Mức lạm phát dưới 4% cho phép NHNN có dư địa nới lỏng tiền tệ nếu cần mà không gây áp lực tăng giá, qua đó duy trì sức mua của người dân.\n* **Tiêu dùng nội địa và bán lẻ:** Nhu cầu tiêu dùng nội địa phục hồi mạnh. Theo Tổng cục Thống kê, doanh thu bán lẻ hàng hóa và dịch vụ quý I/2025 đạt khoảng 1,7 triệu tỷ đồng (65,5 tỷ USD), tăng gần 9,9% so với cùng kỳ năm trước. Sức mua tăng cao nhờ kỳ nghỉ lễ Tết và du khách quốc tế tăng vọt (du lịch tăng 25% so với cùng kỳ). Doanh thu bán lẻ hàng hóa chiếm tỷ trọng lớn (khoảng 76,8% tổng doanh thu bán lẻ, tăng 8,8% YoY). Bộ Công Thương dự báo doanh thu bán lẻ cả nước năm 2025 đạt 350 tỷ USD, tăng tiếp so với 2024 (đã tăng 8,8% YoY). Xu hướng mở cửa du lịch (Việt Nam đón \\~17,6 triệu khách quốc tế năm 2024, gần phục hồi mức 2019) và các chính sách thúc đẩy tiêu dùng (đầu tư công, giảm thuế, tín dụng ưu đãi) đang góp phần duy trì đà chi tiêu mạnh. Tổng hợp: nền kinh tế trong nước tăng trưởng ổn định (\\~6,9% Q1/2025), lãi suất thấp, lạm phát kiểm soát tốt và tiêu dùng tăng cao đều tạo môi trường tích cực cho các doanh nghiệp bán lẻ – đặc biệt ngành trang sức, đá quý.\n\n## Các yếu tố kinh tế toàn cầu\n\n* **Giá vàng thế giới:** Vàng tiếp tục ở mức cao do vai trò tài sản an toàn. Từ cuối năm 2023 tới giữa tháng 3/2025, giá vàng tăng trên 40%, đã chạm mốc \\~3.000 USD/oz. Nhiều tổ chức dự báo vàng tiếp tục tăng: Goldman Sachs kỳ vọng giá vàng sẽ đạt khoảng 3.100 USD/oz cuối 2025 (tăng thêm \\~8%) nhờ lượng mua vàng của các ngân hàng trung ương và triển vọng Fed cắt giảm lãi suất. Các kênh đầu tư giảm lợi suất (Fed có thể giảm lãi suất 2 lần trong 2025) càng làm tài sản không sinh lãi như vàng hấp dẫn nhà đầu tư. Trong bối cảnh bất ổn (chiến tranh, căng thẳng), nhu cầu trú ẩn vào vàng càng tăng cao. Tuy nhiên, vàng tăng giá cũng đẩy chi phí nguyên liệu lên, tác động khó khăn cho doanh nghiệp chế tác nếu không kịp chuyển giá bán.\n* **USD và lãi suất toàn cầu:** Chính sách tiền tệ của Fed và diễn biến USD ảnh hưởng gián tiếp. Hiện Fed duy trì lãi suất cao (khoảng 4,25–4,50% kể từ cuối 2024), nhưng dự báo sẽ cắt giảm dần trong năm 2025. Lãi suất toàn cầu giảm sẽ khiến USD suy yếu, góp phần làm giảm áp lực tỷ giá tại Việt Nam và làm chi phí vay vốn toàn cầu hạ nhiệt. Đồng USD suy yếu cũng thường đẩy giá vàng và hàng hóa tài sản lên cao (qua việc USD mất giá so với các tài sản khác).\n* **Căng thẳng địa chính trị:** Xung đột toàn cầu tiếp tục là rủi ro. Cuộc chiến tại Ukraine, căng thẳng Mỹ – Trung và tình hình Trung Đông (Israel–Iran/Hezbollah) có thể làm gia tăng bất ổn tài chính và nhu cầu trú ẩn. Trong ngắn hạn, các diễn biến quân sự ở Trung Đông từng khiến giá dầu và vàng tăng mạnh (giá dầu Brent có thể vọt lên \\~92 USD/thùng nếu nguồn cung giảm đột ngột) rồi hạ nhiệt khi tình hình tương đối ổn định. Cụ thể, trong tháng 10/2024, thông tin về khả năng ngừng bắn tại Lebanon đã kéo giá dầu và vàng xuống nhanh chóng, thể hiện sức ảnh hưởng lớn của tâm lý rủi ro. Nếu chiến sự tiếp tục leo thang, giá dầu và vàng có thể bật tăng trở lại, song theo WB nhờ dư cung toàn cầu, giá dầu khó duy trì ở mức quá cao lâu dài.\n* **Thương mại và căng thẳng Mỹ – Trung:** Năm 2024-2025 vẫn tồn tại rủi ro từ chiến tranh thương mại. Nhịp độ tăng trưởng kinh tế toàn cầu chậm lại (đặc biệt tại Trung Quốc) có thể làm giảm nhu cầu xuất khẩu của Việt Nam. Đồng thời, Mỹ tiếp tục siết chặt thuế quan với Trung Quốc, khiến nhiều doanh nghiệp tìm chuyển hàng qua các nước như Việt Nam (hiện xuất siêu với Mỹ lớn). Chính quyền Mỹ đe dọa áp thuế cao (lên đến 46%) cho hàng hóa Việt Nam nếu không giải quyết vấn đề này. Việt Nam đã cam kết sẽ siết chặt kiểm soát hàng hóa Trung Quốc đi qua biên giới (kiểm tra gian lận xuất xứ) để tránh bị áp thuế nặng. Nếu đàm phán thành công, mức thuế quan dự kiến sẽ giảm còn khoảng 22–28%. Rủi ro thuế vẫn tồn tại, nhưng Chính phủ đã tích cực thương lượng để giảm thiểu tác động tiêu cực.\n\n## Chính sách nội địa và chính trị ảnh hưởng đến ngành bán lẻ – xa xỉ\n\n* **Khuyến khích tiêu dùng trong nước:** Chính phủ đặt mục tiêu duy trì tăng trưởng trên 8% và đã tuyên bố hỗ trợ đẩy mạnh tiêu dùng nội địa. Các giải pháp bao gồm đầu tư công quy mô lớn, hạ lãi suất vay, khuyến mãi tiêu dùng và cải thiện hạ tầng (công trình giao thông, du lịch, y tế). Ví dụ, Thủ tướng đã công bố kế hoạch tăng chi tiêu công, trong đó có dự án đường sắt xuyên biên giới với Trung Quốc để kích thích sản xuất và lưu thông hàng hóa. Những chính sách này sẽ gia tăng mức chi tiêu của người dân và hỗ trợ doanh số bán lẻ (kể cả mặt hàng trang sức xa xỉ).\n* **Tác động từ xuất khẩu và đàm phán thương mại:** Sự kiện Mỹ tuyên bố áp thuế 46% (chưa thực thi ngay) lên hàng Việt đã gây lo ngại cho các ngành xuất khẩu. Chính phủ Việt Nam đang tích cực đàm phán để giảm bớt mức thuế đó (dự kiến khoảng 22–28%) và mở rộng thị trường xuất khẩu (17 hiệp định FTA đã ký kết). Nếu thành công, áp lực lên xuất khẩu và tăng trưởng sẽ giảm, duy trì sức mạnh kinh tế chung; ngược lại, nếu căng thẳng thương mại kéo dài, tâm lý tiêu dùng (đặc biệt mặt hàng xa xỉ) có thể suy yếu.\n* **Ổn định chính trị, an ninh:** Duy trì ổn định chính trị, an ninh trong nước là điều kiện cơ bản để thu hút du khách và đầu tư. Việt Nam tiếp tục nới lỏng chính sách thị thực (miễn thị thực cho nhiều nước, triển khai e-visa 90 ngày) để đẩy mạnh du lịch. Lượng khách quốc tế về mức gần kỷ lục (17,6 triệu năm 2024) hỗ trợ doanh thu bán lẻ. Môi trường chính trị ổn định cũng giúp doanh nghiệp yên tâm mở rộng kinh doanh (ví dụ ngành bán lẻ trang sức).\n* **Chính sách ngành bán lẻ và xa xỉ:** Hiện Việt Nam chưa có quy định hạn chế đặc biệt với mặt hàng trang sức xa xỉ. Thuế VAT và thuế thu nhập doanh nghiệp áp dụng chung đối với tất cả doanh nghiệp, không phân biệt cao cấp hay đại trà. Các chính sách khuyến mãi, mua sắm trực tuyến (thúc đẩy thương mại điện tử) cũng tạo thuận lợi cho ngành bán lẻ nói chung. Trong quý I/2025, các chương trình khuyến mãi mùa cao điểm (lễ, Tết) đã giúp nhiều doanh nghiệp bán lẻ (kể cả thương hiệu trang sức) thu hút khách mới. Chính phủ cũng khuyến khích ứng dụng công nghệ số trong bán lẻ (kênh online, chuyển đổi số) giúp mở rộng thị trường và tiết giảm chi phí hoạt động.\n\n## Tác động đến thị trường vàng – trang sức và PNJ\n\nCác yếu tố trên tác động trực tiếp đến hoạt động kinh doanh và cổ phiếu PNJ như sau:\n\n* **Nhu cầu trang sức:** Với tiêu dùng nội địa tăng (bán lẻ +8–10%/năm) và du lịch phục hồi, nhu cầu mua trang sức (vừa nhu cầu làm đẹp, vừa quà tặng, vừa tích trữ giá trị) dự kiến tiếp tục cao. Thực tế quý I/2025, doanh thu trang sức bán lẻ của PNJ vẫn tăng \\~6,1% YoY nhờ mở rộng cửa hàng và chương trình marketing hiệu quả. Nhà đầu tư kỳ vọng xu hướng này tiếp tục trong ngắn hạn.\n* **Giá nguyên liệu (vàng thỏi 24K):** Giá vàng thế giới ở đỉnh cao đem lại doanh thu lớn khi bán vàng miếng, nhưng cũng đẩy chi phí hàng tồn kho lên. Quý I/2025, PNJ ghi nhận doanh thu vàng miếng 24K giảm tới 65,8% YoY do nguồn cung vàng thỏi trong nước khan hiếm. Công ty đã chuyển dịch ưu tiên nguồn lực sang bán trang sức (lĩnh vực lõi) để bù đắp. Mặc dù doanh thu 24K giảm, cơ cấu doanh thu chuyển về mảng trang sức (tỷ trọng lên \\~69,3% so với 50,5% năm trước), giúp biên lợi nhuận gộp quý I/2025 của PNJ đạt \\~21,3% (so với 17,1% cùng kỳ). Kết quả này cho thấy PNJ có thể cải thiện biên lãi khi tập trung vào sản phẩm giá trị gia tăng cao hơn. Tuy nhiên, nếu khan hiếm nguyên liệu vẫn kéo dài, doanh thu mảng vàng miếng của công ty sẽ tiếp tục chịu áp lực, ảnh hưởng đến tổng doanh thu.\n* **Đầu tư mở rộng:** PNJ đang tích cực mở rộng hệ thống cửa hàng (kế hoạch thêm 12–25 cửa hàng năm 2025 tùy kịch bản tiêu dùng) và ra mắt các dòng sản phẩm mới (ví dụ: bộ sưu tập dành cho nam “Men Code”, sản phẩm nghệ thuật). Điều này dự kiến duy trì tăng trưởng doanh thu bán lẻ cốt lõi của công ty. Lượng khách hàng mới của PNJ đã tăng 15% trong năm 2024 nhờ mở rộng mạng lưới và đổi mới sản phẩm. Việc nâng cao trải nghiệm và dịch vụ cũng giúp gia tăng sức cạnh tranh. Do đó, về cơ bản PNJ có thế mạnh nội tại để hưởng lợi trong dài hạn.\n* **Tình hình tài chính ngắn hạn:** Kết quả Q1/2025 phần nào phản ánh những biến động trên: PNJ đạt doanh thu thuần 9.635 tỷ đồng (giảm 23,5% YoY) và lợi nhuận sau thuế 678 tỷ đồng (giảm 8,1% YoY). Sự giảm doanh thu tổng chủ yếu do doanh thu vàng miếng giảm mạnh, trong khi mảng trang sức vẫn tăng. Biên lợi nhuận được cải thiện (21,3% so với 17,1% cùng kỳ) nhờ tỷ trọng bán hàng biên cao tăng lên. Nhà đầu tư cần lưu ý kết quả này khi đánh giá triển vọng ngắn hạn; tuy nhiên, công ty vẫn duy trì cổ tức tiền mặt cao (khoảng 2,000 đồng/cổ phiếu, \\~2.9% suất sinh lợi) và chiến lược quản lý chi phí hiệu quả.\n\n## Kịch bản và xu hướng giá cổ phiếu PNJ\n\nCác kịch bản vĩ mô chính có thể diễn ra trong 6-12 tháng tới và ảnh hưởng tới PNJ như sau:\n\n1. **Kịch bản thuận lợi (Kinh tế ổn định – Vàng cao):** Kinh tế Việt Nam tiếp tục duy trì tăng trưởng mạnh (\\~7-8%), lạm phát thấp, tiêu dùng nội địa sôi động và du lịch bùng nổ. Giá vàng thế giới ở mức cao (≥3.000 USD/oz) do bất ổn toàn cầu tăng cao (căng thẳng Địa Trung Hải/Trung Đông, chiến sự kéo dài). Trong kịch bản này, PNJ thu hút được nhiều khách hàng mua trang sức và tích trữ vàng, doanh thu bán lẻ tăng, kết quả kinh doanh khả quan. Mặc dù giá vốn tăng, PNJ có thể điều chỉnh giá bán hoặc tập trung vào sản phẩm biên lợi nhuận cao để bù đắp. Theo các công ty chứng khoán, PNJ được đánh giá tích cực với P/E dự phóng khoảng 13x (dưới mức trung bình 17x lịch sử), nên trong kịch bản tích cực giá cổ phiếu có thể tăng về mức 120.000–130.000 đ (khả năng đạt giá mục tiêu 120.500 theo BVSC).\n\n2. **Kịch bản trung tính (Tăng trưởng vừa phải – Biến động vừa phải):** Kinh tế thế giới và trong nước tăng trưởng chậm lại đôi chút, Fed cắt giảm lãi suất chậm, giá vàng điều chỉnh hạ sau đợt tăng nóng. Trong nước lạm phát vẫn dưới mục tiêu, lãi suất duy trì thấp, nhưng tăng trưởng tiêu dùng có thể giảm tốc so với giai đoạn trước. PNJ có thể đạt tăng trưởng doanh thu khiêm tốn (bán lẻ ổn định, doanh thu vàng không tăng đột biến) còn lợi nhuận tăng trưởng chậm. Giá cổ phiếu PNJ có thể dao động bên dưới mức hiện tại, phản ánh kỳ vọng đạt kế hoạch lợi nhuận tương đối cao năm 2025 nhưng cũng tiềm ẩn rủi ro tăng trưởng bình thường. Trong kịch bản này, cổ phiếu có thể duy trì vùng giá 90.000–110.000 đồng, chờ tín hiệu vĩ mô rõ ràng hơn.\n\n3. **Kịch bản bất lợi (Tăng trưởng yếu – Rủi ro cao):** Kinh tế toàn cầu đình trệ hoặc suy thoái (Fed duy trì lãi suất cao lâu), căng thẳng thương mại Mỹ–Trung leo thang, dẫn đến nhu cầu xuất khẩu của Việt Nam giảm và tâm lý tiêu dùng trong nước suy giảm. Giá vàng có thể biến động mạnh (thời điểm phục hồi rồi hạ xuống). Đặc biệt, nếu Mỹ thực thi thuế 46% đối với một số mặt hàng VN hoặc xảy ra biến số địa chính trị nghiêm trọng (kéo dài chiến tranh), thì chi tiêu cho hàng xa xỉ có thể giảm. PNJ trong kịch bản này sẽ gặp khó (doanh thu tăng trưởng thấp hoặc âm, lợi nhuận giảm). Giá cổ phiếu có thể điều chỉnh giảm về vùng giá hỗ trợ cũ (thấp hơn 90.000 đồng). Tuy nhiên, ngay cả trong kịch bản bất lợi, PNJ vẫn sở hữu vị thế dẫn đầu thị trường với mạng lưới rộng và thương hiệu mạnh, do đó giảm giá sâu là khó xảy ra nếu không có cú sốc lớn. Nhà đầu tư cũng có thể coi đây là cơ hội tích luỹ ngắn hạn.\n\n**Nhận định:** Trong ngắn hạn (vài tháng tới), cổ phiếu PNJ nhiều khả năng sẽ dao động theo diễn biến kết quả kinh doanh và giá vàng. Việc thiếu nguyên liệu vàng quý I/2025 đã phần nào ảnh hưởng tiêu cực (PNJ giảm doanh thu), nhưng khả năng phục hồi khi nguồn cung ổn định trở lại và khi giá vàng tiếp tục duy trì ở mức cao vẫn hỗ trợ tích cực cho cổ phiếu. Về trung hạn (6-12 tháng), các yếu tố chính được kỳ vọng là tăng trưởng tiêu dùng trong nước, phục hồi du lịch và sự phục hồi giá vàng. Nếu kinh tế Việt Nam tiếp tục giữ đà tăng trưởng tốt và Chính phủ kiểm soát tốt rủi ro thương mại, xu hướng dài hạn của PNJ là tăng giá. Theo đánh giá của BVSC, PNJ vẫn được khuyến nghị “Outperform” với giá mục tiêu \\~120.500 đồng/cp, cho thấy dư địa tăng giá vẫn khả quan. Tuy nhiên, nhà đầu tư cần theo dõi sát diễn biến lạm phát, lãi suất và các diễn biến địa chính trị mới (Mỹ – Trung, xung đột) để điều chỉnh chiến lược kịp thời.\n\n**Tóm tắt dưới dạng bảng:**\n\n| Yếu tố vĩ mô                 | Diễn biến gần đây / Dự báo                                                                                          | Tác động đến PNJ                                                                                                                                                                 |\n| ---------------------------- | ------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Lãi suất chính sách**      | Lãi suất vay ngân hàng giảm về \\~6,34%/năm (hạ 0,6% điểm so với cuối 2024); NHNN giữ lãi suất điều hành ở mức thấp. | Giúp giảm chi phí vay vốn, hỗ trợ tăng trưởng tín dụng. Giúp doanh nghiệp (bao gồm PNJ) dễ tiếp cận vốn rẻ hơn để mở rộng kinh doanh.                                            |\n| **Lạm phát**                 | 2024 \\~3,63% (dưới mục tiêu); Q1/2025 \\~3,22%. Giá cả ổn định nhờ giá dầu, lương thực giảm.                         | Lạm phát thấp tăng khả năng chi tiêu thực tế của người dân. Tiêu dùng trang sức, xa xỉ ổn định hoặc tăng nhờ sức mua không bị xói mòn.                                           |\n| **Tiêu dùng nội địa**        | Doanh thu bán lẻ Q1/2025 tăng \\~9,9% YoY. Du lịch tăng mạnh (17,6 triệu lượt khách 2024).                           | Tăng chi tiêu cho hàng tiêu dùng và trang sức. Mở rộng khách hàng mua sắm (cả dân cư và du khách).                                                                               |\n| **Tỷ giá VND/USD**           | 4/2025: \\~25.896 VND/USD (tăng 1,64% so cuối 2024); dự báo \\~25.800-26.000 VND/USD Q3/2025.                         | Tỷ giá ổn định tạo thuận lợi cho nhập khẩu nguyên liệu vàng và trang sức. Nếu VND yếu nhẹ, giá nguyên liệu nhập có thể cao hơn, nhưng phần lớn sản phẩm PNJ sản xuất trong nước. |\n| **Giá vàng thế giới**        | Tăng mạnh (\\~40% từ 2023 đến Q1/2025, đạt \\~3.000 USD/oz); dự báo tăng tiếp \\~8% lên \\~3.100 USD/oz cuối 2025.      | Tăng giá vàng giúp PNJ bán được sản lượng lớn (doanh thu 24K tăng khi có hàng), nhưng cũng làm tăng giá vốn. Tác động trung tính đến lợi nhuận gộp (bù trừ).                     |\n| **Lãi suất Fed / USD**       | Fed đã và đang giữ lãi suất cao; dự báo có thể cắt giảm 2 lần trong 2025. USD có thể suy yếu.                       | USD yếu hỗ trợ VND bớt áp lực, giảm áp lực lên NHNN; cũng khiến vàng hấp dẫn hơn. Lãi suất toàn cầu giảm tạo điều kiện cho doanh nghiệp vay nợ rẻ hơn.                           |\n| **Căng thẳng địa chính trị** | Cuộc chiến Ukraine, căng thẳng Trung Đông tiếp diễn, Mỹ–Trung dai dẳng. Giá dầu/vàng có thể biến động thất thường.  | Khi bất ổn tăng, nhà đầu tư trú ẩn vào vàng và trang sức (lợi cho PNJ); nhưng nếu xung đột quá nghiêm trọng có thể ảnh hưởng tâm lý tiêu dùng (tạm thời giảm mua sắm xa xỉ).     |\n| **Thuế quan Mỹ – Việt Nam**  | Đàm phán giảm thuế quan (46% chưa áp dụng, mong giảm còn \\~25%); Việt Nam sẽ tăng kiểm soát xuất xứ.                | Nếu thành công hạn chế thuế quan, xuất khẩu ổn định, kinh tế vĩ mô không bị xáo trộn – hỗ trợ niềm tin tiêu dùng. Nếu thất bại, tăng trưởng chung giảm, tiêu dùng yếu đi.        |\n\n**Nguồn:** Số liệu và phân tích dựa trên các báo cáo kinh tế, bản tin thị trường và tài liệu chuyên ngành. (PNJ = Công ty CP Vàng bạc Đá quý Phú Nhuận)",
            "enabled": true
        },
        {
            "keyword": "stk@",
            "type": "text",
            "content": "Vietinbank : 105872802337 / Vũ Đức Mạnh",
            "enabled": true
        },
        {
            "keyword": "tt@",
            "type": "mixed",
            "content": {
                "text": "dsadsadsadaddsadas",
                "images": [
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397963288_544aa463806e982d38bf84a21b65202c.jpg",
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397970677_6258ddf1d7c8e5391d988b2727f5448f.jpg",
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397974984_bb8e3ec84a0ae0590be7d450014fee88.jpg",
                    "C:/Users/Admin/OneDrive/Tài liệu/logo malorant.png"
                ]
            },
            "enabled": true
        },
        {
            "keyword": "dsada",
            "type": "text",
            "content": "dsadsadasdasd",
            "enabled": true
        },
        {
            "keyword": "gg@",
            "type": "text",
            "content": "dsadada",
            "enabled": false
        },
        {
            "keyword": "ttt@",
            "type": "mixed",
            "content": {
                "text": "sdadsadada",
                "images": [
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397963288_544aa463806e982d38bf84a21b65202c.jpg",
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397970677_6258ddf1d7c8e5391d988b2727f5448f.jpg",
                    "C:/Users/Admin/OneDrive/Tài liệu/z2998397974984_bb8e3ec84a0ae0590be7d450014fee88.jpg"
                ]
            },
            "enabled": true
        },
        {
            "keyword": "t1@",
            "type": "text",
            "content": "q",
            "enabled": true
        },
        {
            "keyword": "t2@",
            "type": "text",
            "content": "13",
            "enabled": true
        },
        {
            "keyword": "test",
            "type": "text",
            "content": "This is a test",
            "enabled": true
        },
        {
            "keyword": "mail @",
            "type": "text",
            "content": "manjducvu0508@gmail.com",
            "enabled": true
        },
        {
            "keyword": "he @",
            "type": "text",
            "content": "dsadasdsa",
            "enabled": true
        },
        {
            "keyword": "linktr @",
            "type": "text",
            "content": "Bạn ib qua đây giúp mình: \nhttps://www.facebook.com/NTT66668888?mibextid=LQQJ4d",
            "enabled": true
        },
        {
            "keyword": "mailt @",
            "type": "text",
            "content": "nguyenanhtuan2003de@gmail.com",
            "enabled": true
        },
        {
            "keyword": "cccd@",
            "type": "text",
            "content": "dsadada",
            "enabled": true
        }
    ]
}